Repository: EuphoriaLux/Auto-Right
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de, fr

source: WELCOME TO DATA RIGHTS AUTOMATION IN LUXEMBOURG
de: WILLKOMMEN BEI DER DATENRECHTEAUTOMATISIERUNG IN LUXEMBURG
fr: BIENVENUE DANS L'AUTOMATISATION DES DROITS DE DONNÉES AU LUXEMBOURG

source: Take Command of Your
de: Übernimm die Kontrolle über dein
fr: Prenez le Contrôle de Votre

source: Digital Self
de: digitales Ich
fr: Moi Numérique

source: Today!
de: Heute!
fr: Aujourd'hui !

source: Imagine a digital world where you’re in full control of your personal data. That’s what we offer. With Automate Your Data Rights in Luxembourg, we introduce you to the next level of data management. Don't let your information float aimlessly in the vast digital ocean. Equip yourself with our tool to retrieve, correct, delete, and port your data seamlessly. Why wait? Dive in, and shield yourself from identity theft, spam, data leaks, and much more!
de: Stellen Sie sich eine digitale Welt vor, in der Sie die volle Kontrolle über Ihre persönlichen Daten haben. Das bieten wir Ihnen. Mit Automate Your Data Rights in Luxembourg führen wir Sie in die nächste Stufe des Datenmanagements ein. Lassen Sie Ihre Informationen nicht ziellos im weiten digitalen Ozean treiben. Rüsten Sie sich mit unserem Tool aus, um Ihre Daten nahtlos abzurufen, zu korrigieren, zu löschen und zu übertragen. Warum warten? Tauchen Sie ein und schützen Sie sich vor Identitätsdiebstahl, Spam, Datenlecks und vielem mehr!
fr: Imaginez un monde numérique où vous avez le plein contrôle de vos données personnelles. C'est ce que nous offrons. Avec Automatisez Vos Droits de Données au Luxembourg, nous vous introduisons au niveau supérieur de la gestion des données. Ne laissez pas vos informations flotter sans but dans le vaste océan numérique. Équipez-vous de notre outil pour récupérer, corriger, supprimer et transférer vos données de manière transparente. Pourquoi attendre ? Plongez et protégez-vous contre le vol d'identité, le spam, les fuites de données, et bien plus encore !

source: Discover How It Works
de: Entdecken Sie, wie es funktioniert
fr: Découvrez Comment Ça Marche

source: or
de: oder
fr: ou

source: Got Questions? See FAQs
de: Haben Sie Fragen? Sehen Sie sich die FAQs an
fr: Des Questions ? Consultez la FAQ

source: Create Your Account
de: Erstellen Sie Ihr Konto
fr: Créez Votre Compte

source: Join us and take control of your digital identity.
de: Schließen Sie sich uns an und übernehmen Sie die Kontrolle über Ihre digitale Identität.
fr: Rejoignez-nous et prenez le contrôle de votre identité numérique.

source: Email Address
de: E-Mail-Adresse
fr: Adresse E-mail

source: you@example.com
de: du@beispiel.com
fr: vous@exemple.com

source: Choose a Password
de: Wählen Sie ein Passwort
fr: Choisissez un Mot de Passe

source: At least 8 characters
de: Mindestens 8 Zeichen
fr: Au moins 8 caractères

source: Confirm Your Password
de: Bestätigen Sie Ihr Passwort
fr: Confirmez Votre Mot de Passe

source: Repeat the password
de: Wiederholen Sie das Passwort
fr: Répétez le mot de passe

source: Join Now
de: Jetzt beitreten
fr: Rejoignez-Nous Maintenant

source: We Empower You With
de: Wir ermächtigen Sie mit
fr: Nous Vous Donnons le Pouvoir Avec

source: Protection
de: Schutz

source: Take control of your digital identity by simplifying and automating processes related to personal data management in Luxembourg.
de: Übernehmen Sie die Kontrolle über Ihre digitale Identität, indem Sie Prozesse im Zusammenhang mit der Verwaltung persönlicher Daten in Luxemburg vereinfachen und automatisieren.
fr: Prenez le contrôle de votre identité numérique en simplifiant et en automatisant les processus liés à la gestion des données personnelles au Luxembourg.

source: data retrieval
de: Datenabruf
fr: récupération des données

source: Simplify the complex process of data retrieval from various platforms.
de: Vereinfachen Sie den komplexen Prozess des Datenabrufs von verschiedenen Plattformen.
fr: Simplifiez le processus complexe de récupération des données à partir de diverses plateformes.

source: data deletion
de: Datenlöschung
fr: suppression des données

source: Automate Data Deletion
de: Automatisieren Sie die Datenlöschung
fr: Automatiser la Suppression des Données

source: Schedule and manage data deletion from databases you no longer want to associate with.
de: Planen und verwalten Sie die Löschung von Daten aus Datenbanken, mit denen Sie nicht mehr in Verbindung stehen möchten.
fr: Planifiez et gérez la suppression des données des bases de données avec lesquelles vous ne souhaitez plus être associé.

source: data corrections
de: Datenkorrekturen
fr: corrections de données

source: Automate Data Corrections
de: Automatisieren Sie Datenkorrekturen
fr: Automatiser les Corrections de Données

source: Easily correct any inaccurate data points about you across various platforms.
de: Korrigieren Sie einfach alle ungenauen Datenpunkte über Sie auf verschiedenen Plattformen.
fr: Corrigez facilement tout point de données inexact vous concernant sur diverses plateformes.

source: data portability
de: Datenportabilität
fr: portabilité des données

source: Automate Data Portability
de: Automatisieren Sie die Datenportabilität
fr: Automatiser la Portabilité des Données

source: Transfer your data effortlessly between different services, making it work for you.
de: Übertragen Sie Ihre Daten mühelos zwischen verschiedenen Diensten, sodass sie für Sie arbeiten.
fr: Transférez vos données sans effort entre différents services, en les mettant à votre service.

source: Explore Our
de: Entdecken Sie unsere
fr: Explorez Nos

source: Features
de: Funktionen
fr: Fonctionnalités

source: Modules
de: Module

source: Our application offers features to ensure optimal data rights management for individuals & Companies
de: Unsere Anwendung bietet Funktionen zur optimalen Verwaltung der Datenrechte für Einzelpersonen und Unternehmen.
fr: Notre application offre des fonctionnalités pour assurer une gestion optimale des droits de données pour les individus et les entreprises.

source: Data Retrieval Module
de: Datenabruf-Modul
fr: Module de Récupération des Données

source: Data Deletion Automation
de: Automatisierung der Datenlöschung

source: Automated Data Deletion
de: Automatisierte Datenlöschung
fr: Suppression Automatisée des Données

source: Data Correction System
de: Datenkorrektursystem
fr: Système de Correction des Données

source: Effortless Data Portability
de: Mühelose Datenportabilität
fr: Portabilité des Données sans Effort

source: Risk Prevention Dashboard
de: Dashboard zur Risikoprävention
fr: Tableau de Bord de Prévention des Risques

source: Risk Prevention
de: Risikoprävention
fr: Prévention des Risques

source: User-Friendly Interface
de: Benutzerfreundliche Schnittstelle
fr: Interface Conviviale

source: Empowering You to
de: Befähigung für Sie
fr: Vous Donnant le Pouvoir de

source: Take Control
de: Übernehmen Sie die Kontrolle
fr: Prendre le Contrôle

source: of Your
de: über Ihr
fr: de Votre

source: Digital Identity
de: digitales Identität
fr: Identité Numérique

source: Our cutting-edge Django application is designed to simplify and automate the management of your personal data rights. Ensure your digital safety in a world with increasing risks associated with data privacy.
de: Unsere hochmoderne Django-Anwendung wurde entwickelt, um die Verwaltung Ihrer persönlichen Datenrechte zu vereinfachen und zu automatisieren. Sichern Sie Ihre digitale Sicherheit in einer Welt mit zunehmenden Risiken im Zusammenhang mit Datenschutz.
fr: Notre application Django à la pointe de la technologie est conçue pour simplifier et automatiser la gestion de vos droits de données personnelles. Assurez votre sécurité numérique dans un monde où les risques associés à la confidentialité des données sont de plus en plus grands.

source: Data Retrieval
de: Datenabruf
fr: Récupération des Données

source: Data Deletion
de: Datenlöschung
fr: Suppression des Données

source: Data Corrections
de: Datenkorrekturen
fr: Corrections des Données

source: With features like One-Click Automation, Risk Prevention, and Data Portability, our application ensures you have complete control over your data across various platforms, giving you peace of mind in an interconnected digital landscape.
de: Mit Funktionen wie Ein-Klick-Automatisierung, Risikoprävention und Datenportabilität stellt unsere Anwendung sicher, dass Sie die vollständige Kontrolle über Ihre Daten auf verschiedenen Plattformen haben, was Ihnen Sicherheit in einer vernetzten digitalen Landschaft bietet.
fr: Avec des fonctionnalités telles que l'Automatisation en Un Clic, la Prévention des Risques et la Portabilité des Données, notre application vous assure un contrôle total sur vos données à travers diverses plateformes, vous offrant la tranquillité d'esprit dans un paysage numérique interconnecté.

source: Contact Us
de: Kontaktieren Sie uns
fr: Contactez-Nous

source: Get In
de: In Kontakt treten
fr: Entrer en

source: Touch
de: mit uns
fr: Contact

source: Your Name...
de: Ihr Name...
fr: Votre Prénom...

source: Your Surname...
de: Ihr Nachname...
fr: Votre Nom...

source: Your E-mail...
de: Ihre E-Mail...
fr: Votre E-mail...

source: Subject...
de: Betreff...
fr: Sujet...

source: Your Message
de: Ihre Nachricht
fr: Votre Message

source: Send Message Now
de: Nachricht jetzt senden
fr: Envoyer le Message Maintenant

source: AutoRight - Data Rights Automation Platform
de: AutoRight - Plattform zur Automatisierung von Datenrechten
fr: AutoRight - Plateforme d'Automatisation des Droits de Données

source: Services
de: Dienstleistungen

source: Projects
de: Projekte
fr: Projets

source: Automate
de: Automatisieren
fr: Automatiser

source: Requests
de: Anfragen
fr: Demandes

source: User
de: Benutzer
fr: Utilisateur

source: Login
de: Anmelden
fr: Connexion

source: View Companies by Category
de: Unternehmen nach Kategorie anzeigen
fr: Voir les Entreprises par Catégorie

source: Profile
de: Profil
fr: Profil

source: Logout
de: Abmelden
fr: Déconnexion

source: For Your Data Rights
fr: Pour Vos Droits sur les Données
